partners_data = [
  {
    "id": 1,
    "name": "Яндекс Маркет",
    "categories": ["Разные товары"]
  },
  {
    "id": 2,
    "name": "МТС",
    "categories": ["Электроника"]
  },
  {
    "id": 3,
    "name": "ХОЛОДИЛЬНИК.РУ",
    "categories": ["Электроника"]
  },
  {
    "id": 4,
    "name": "Покрышка.ру",
    "categories": ["Авто"]
  },
  {
    "id": 5,
    "name": "FIT Service",
    "categories": ["Расходные материалы", "Одежда", "Мерч"]
  },
  {
    "id": 6,
    "name": "Лукойл",
    "categories": ["Заправки"]
  },
  {
    "id": 7,
    "name": "Tatneft",
    "categories": ["Моторное масло", "Трансмиссионное масло"]
  },
  {
    "id": 8,
    "name": "Acoola",
    "categories": ["Детская одежда", "Аксессуары"]
  },
  {
    "id": 9,
    "name": "Кораблик",
    "categories": ["Игрушки", "Подгузники", "Детское питание", "Одежда для малышей", "Товары для беременных женщин", "Мебель"]
  },
  {
    "id": 10,
    "name": "Акушерство",
    "categories": ["Медицинские товары", "Акушерство и гинекология"]
  },
  {
    "id": 11,
    "name": "Бургер Кинг",
    "categories": ["Бургеры", "Сэндвичи"]
  },
  {
    "id": 12,
    "name": "Крошка Картошка",
    "categories": ["Кафе"]
  },
  {
    "id": 13,
    "name": "Шоколадница",
    "categories": ["Кафе"]
  },
  {
    "id": 14,
    "name": "Lamoda",
    "categories": ["Одежда", "Обувь", "Аксессуары", "Игрушки", "Детские товары", "Товары для дома", "Косметика", "Парфюмерия", "Товары для спорта", "Ювелирные изделия", "Книги"]
  },
  {
    "id": 15,
    "name": "Gulliver Market",
    "categories": ["Детская одежда", "Бижутерия", "Комплекты постельного белья", "Водолазки", "Лонгсливы", "Костюмные жилеты", "Пиджаки", "Сумки", "Рюкзаки", "Аксессуары для волос", "Бабочки", "Галстуки", "Головные уборы", "Ремни", "Шарфы"]
  },
  {
    "id": 16,
    "name": "Ozon",
    "categories": ["Разные товары"]
  },
  {
    "id": 17,
    "name": "Dewal",
    "categories": ["Аппараты для ухода за волосами", "Воскоплавы", "Косметологические кресла", "Массажные кушетки", "Стерилизаторы", "Стулья", "Тележки", "Вапоризаторы", "Воротнички парикмахерские", "Полотенца одноразовые"]
  },
  {
    "id": 18,
    "name": "E.Mi",
    "categories": ["Гель-лаки", "Базы гель-лак", "Гелевая система", "Декор для ногтей", "Косметика для волос"]
  },
  {
    "id": 19,
    "name": "GELLAK.PRO",
    "categories": ["Профессиональная косметика для ногтей", "Расходные материалы"]
  },
  {
    "id": 20,
    "name": "Med-Магазин.ru",
    "categories": ["Медицинская мебель", "Медтехника", "Ортопедия", "Медицинское оборудование"]
  },
  {
    "id": 21,
    "name": "МЕDСИ",
    "categories": ["Здоровье"]
  },
  {
    "id": 22,
    "name": "Gipfel",
    "categories": ["Столовые приборы", "Посуда для сервировки", "Кастрюли", "Ковши", "Кухонные аксессуары", "Сковородки", "Сотейники", "Кофемолки", "Мельницы", "Термосы"]
  },
  {
    "id": 23,
    "name": "Ormatek",
    "categories": ["Матрасы", "Наматрасники", "Одеяла", "Подушки", "Постельное белье", "Основания для кровати", "Кровати", "Мебель для спальни"]
  },
  {
    "id": 24,
    "name": "RE",
    "categories": ["Apple", "Смартфоны", "Планшеты", "Умные часы", "Наушники", "Игры и консоли", "Портативная акустика", "Умный дом", "ТВ", "Видео-аудио", "Бытовая техника", "Гейминг", "Для кухни", "Освещение", "Товары для питомцев", "Интерьер", "Мебель", "Инструменты"]
  },
  {
    "id": 25,
    "name": "Baon",
    "categories": ["Одежда", "Спорт"]
  },
  {
    "id": 26,
    "name": "Снежная королева",
    "categories": ["Одежда и аксессуары"]
  },
  {
    "id": 27,
    "name": "Пятерочка",
    "categories": ["Продукты"]
  },
  {
    "id": 28,
    "name": "Перекресток",
    "categories": ["Продукты"]
  },
  {
    "id": 29,
    "name": "Спортмастер",
    "categories": ["Спорт"]
  },
  {
    "id": 30,
    "name": "ВелоСтрана.ru",
    "categories": ["Велосипеды", "Экипировка", "Самокаты", "Веломастерская"]
  },
  {
    "id": 31,
    "name": "Росгосстрах",
    "categories": ["Страхование"]
  },
  {
    "id": 32,
    "name": "Страховой Дом ВСК",
    "categories": ["Страхование"]
  },
  {
    "id": 33,
    "name": "Строительный двор",
    "categories": ["Товары для ремонта"]
  },
  {
    "id": 34,
    "name": "Двин",
    "categories": ["Мебель для ванной", "Раковины", "Унитазы", "Биде", "Смесители", "Душевые кабины", "Ванны", "Кухонные мойки", "Полотенцесушители", "Радиаторы", "Водонагреватели", "Клининг"]
  },
  {
    "id": 35,
    "name": "Бетховен",
    "categories": ["Товары для собак", "Товары для кошек", "Ветаптека", "Товары для птиц", "Аквариумистика"]
  },
  {
    "id": 36,
    "name": "Старая ферма",
    "categories": ["Корм для животных", "Аксессуары", "Одежда", "Игрушки", "Ветеринарные препараты"]
  }
]